trunk/app/controllers/tasks_controller.rb

  def complete
    @task = Task.find(params[:task_id])
    @project = @task.project
    @membership = current_user.memberships.select{|m| m.project_id.to_s == params[:id]}.first
    #Commented out to allow anyone to complete a task
    #if !@membership.is_owner?
    #  flash[:notice] = "You do not have the privilege to complete this task!"
    #  redirect_to project_path(@project)
    @assignments = Assignment.find(:all, :conditions => { :task_id =>  @task })
    completion = true
    @assignments.each do |assig|
      if !assig.is_complete?
        completion = false
      end
    end
    if  completion#all tasks are complete
      if @task.update_attribute(:completed_at,Time.now)
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
SELECT * FROM "projects" WHERE ("projects"."id" = 3)
UPDATE "tasks" SET "updated_at" = '2009-11-22 10:12:25', "completed_at" = '2009-11-22 10:12:25' WHERE "id" = 3

  def reopen
    @task = Task.find(params[:task_id])
    @project = @task.project
    #Commented out to allow anyone to reopen a task
    #if !@membership.is_owner?
    #  flash[:notice] = "You do not have the privilege to reopen this task!"
    #  redirect_to project_path(@project)
    if @task.update_attribute(:completed_at,nil)
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
UPDATE "tasks" SET "updated_at" = '2009-11-22 10:16:44', "completed_at" = NULL WHERE "id" = 3

  def index
    @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def new
    @project = Project.find(params[:project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)

  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.build(params[:task])

    respond_to do |format|
      if @task.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "tasks" ("name", "completed_at", "task_id", "created_at", "project_id", "updated_at", "due_by", "desc") VALUES('PROJECT MY PROJECT', NULL, NULL, '2009-11-09 07:32:29', 1, '2009-11-09 07:32:29', '2009-11-10 07:31:00', 'LIKE, TELL PEOPLE ABOUT IT AND STUFFS.