app/controllers/assignments_controller.rb

SELECT * FROM "assignments" WHERE ("assignments"."id" = 2)
UPDATE "assignments" SET "updated_at" = '2009-11-22 09:36:19', "user_id" = 2 WHERE "id" = 2
---
  def take
    @assignment = Assignment.find(params[:id])
    @task = @assignment.task
    @project = @task.project
    if @assignment.user == nil
      @assignment.user = current_user
      if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 18)
UPDATE "assignments" SET "completed_at" = NULL, "updated_at" = '2009-11-23 05:05:30' WHERE "id" = 18
---
  def drop
    @assignment = Assignment.find(params[:id])
    @task = @assignment.task
    @project = @task.project
    if @assignment.user == current_user
      @assignment.drop
      if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 18)
UPDATE "assignments" SET "completed_at" = '2009-11-23 05:05:21', "updated_at" = '2009-11-23 05:05:21' WHERE "id" = 18
---
  def complete
    @assignment = Assignment.find(params[:id])
    @task = @assignment.task
    @project = @task.project
    if @assignment.user == current_user && (not @assignment.is_complete?)
    @assignment.complete
      if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 18)
UPDATE "assignments" SET "completed_at" = NULL, "updated_at" = '2009-11-23 05:55:37' WHERE "id" = 18
---
  def uncomplete
    @assignment = Assignment.find(params[:id])
    @task = @assignment.task
    @project = @task.project
    if @assignment.user == current_user && @assignment.is_complete?
      @assignment.uncomplete
      if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @assignment = Assignment.find(params[:id])    #respond_to do |format|
    #  format.html # index.html.erb
    #  format.xml  { render :xml => @assignments }
    @task = @assignment.task
    @project = @task.project

    @assignee = @assignment.user
    @members = @project.memberships.select { |member| member.is_approved? }
    @candidates = @members.collect { |member| member.user }

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
---
  def new
    @task = Task.find(params[:task_id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
SELECT * FROM "assignments" WHERE ("assignments"."id" = 1)
---
  def edit
    @task = Task.find(params[:task_id])
    @project = @task.project
    @assignment = Assignment.find(params[:id])

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
INSERT INTO "assignments" ("name", "completed_at", "updated_at", "due_by", "task_id", "desc", "user_id", "hours_spent", "created_at", "start_time") VALUES('Grow', NULL, '2009-11-23 05:27:47', '2014-11-23 05:27:00', 2, 'Grow the weed', NULL, NULL, '2009-11-23 05:27:47', '2009-11-23 05:27:00')
---
  def create
    @task = Task.find(params[:task_id])
    @assignment = @task.assignments.build(params[:assignment])

    respond_to do |format|
      if @assignment.save

SELECT * FROM "assignments" WHERE ("assignments"."id" = 18)
UPDATE "assignments" SET "desc" = 'Smoke some to make sure it''s good.', "updated_at" = '2009-11-23 04:23:03' WHERE "id" = 18
---
  def update
    @assignment = Assignment.find(params[:id])
    @task = @assignment.task
    @project = @task.project

    respond_to do |format|
      if @assignment.update_attributes(params[:assignment])

SELECT * FROM "assignments" WHERE ("assignments"."id" = 19)
DELETE FROM "assignments" WHERE "id" = 19
---
  def destroy
    @assignment = Assignment.find(params[:id])
    @assignment.destroy