app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "memberships" ("project_id", "updated_at", "user_id", "privilege", "created_at") VALUES(1, '2009-11-20 10:16:52', 1, NULL, '2009-11-20 10:16:52')
---
  def join
    @project = Project.find(params[:project_id])
    @user = current_user
    @membership = Membership.new
    @membership.user = @user
    @membership.project = @project
    @membership.set_permission("user")
    if @membership.save

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
SELECT * FROM "memberships" WHERE ("memberships"."project_id" = 3 AND "memberships"."user_id" = 3) LIMIT 1
DELETE FROM "memberships" WHERE "id" = 5
---
  def leave
    @project = Project.find(params[:project_id])
    @user = current_user
    @membership = Membership.find(:first, :conditions=>{:user_id=>@user.id, :project_id=>@project.id})
    if @membership.destroy

SELECT * FROM "projects" WHERE ("projects"."public" = 't') LIMIT 1
---
  def home
    if logged_in?
      redirect_to dashboard_path
    else
        @projects = Project.find(:all, :limit => 10, :conditions => { :public => true })

SELECT * FROM "projects" WHERE ("projects"."public" = 'f')
---
  def index
    @projects = Project.find(:all, :conditions => { :public => true })

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "created_at", "public", "updated_at", "desc", "due") VALUES('Project N', '2009-11-09 07:34:43', 'f', '2009-11-09 07:34:43', 'The secret project N is a secret. Even though you can just type in the URL and see it anyway.
---
  def create
    @project = Project.new(params[:project])
    print @project

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
UPDATE "projects" SET "name" = 'Weed-Selling Project', "desc" = 'We are starting a weed middleman business.', "updated_at" = '2009-11-23 04:22:33' WHERE "id" = 2
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM "projects" WHERE ("projects"."id" = 4)
DELETE FROM "projects" WHERE "id" = 4
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy