app/controllers/tasks_controller.rb

  def assign
    @task = Task.find(params[:task_id])
    @user = current_user
    @assignment = Assignment.new
    @assignment.task = @task
    @assignment.user = @user
    if @assignment.save
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
INSERT INTO "assignments" ("task_id", "created_at", "updated_at", "user_id") VALUES(1, '2009-11-08 06:45:01', '2009-11-08 06:45:01', 1)