app/controllers/users_controller.rb

  def show
    begin @user = User.find(params[:id])
    rescue Exception
      @user = current_user
    end

    @assignments = @user.assignments
    @late_assignments = @assignments.select{|assignment| assignment.due_by < Time.now}
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "assignments" WHERE ("assignments".user_id = 1)

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.capitalize_name
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('anhang zhu', '1b629b5f212146358fe1165ba932fa4400e4846f', '2009-11-20 09:24:02', '91b9fa1e31a15e3e7a27d93478a8e4e446fe8450', NULL, NULL, 'anhang', 'anhang@gmail.com', '2009-11-20 09:24:02')